-- 色々な条件で抽出する

-- テーブルの準備

$ use db1

$ CREATE TABLE tb(bang VARCHAR(10), uria INT, tuki INT);

$ INSERT INTO tb (bang, uria, tuki) VALUES('A103', 101, 4), ('A102', 54, 5), ('A104', 181, 4), ('A101', 184, 4), ('A103', 17, 5), ('A101', 300, 5), ('A102', 205, 6), ('A104', 93, 5), ('A103', 12, 6), ('A107', 87, 6);

-- これで練習用のテーブルは作成できた

●カラムを入れ替えて表示する--------------------------------------------

$ SELECT uria,bang FROM tb;
-- +------+------+
-- | uria | bang |
-- +------+------+
-- |  101 | A103 |
-- |   54 | A102 |
-- |  181 | A104 |
-- |  184 | A101 |
-- |   17 | A103 |
-- |  300 | A101 |
-- |  205 | A102 |
-- |   93 | A104 |
-- |   12 | A103 |
-- |   87 | A107 |
-- +------+------+
-- 10 rows in set (0.00 sec)


●カラム名をわかりやすいようにエイリアスを使う------------------------------------------

$ SELECT カラム名 AS エイリアス FROM テーブル名;

$ SELECT bang AS 社員番号, uria AS 売上 FROM tb;

-- +--------------+--------+
-- | 社員番号     | 売上   |
-- +--------------+--------+
-- | A103         |    101 |
-- | A102         |     54 |
-- | A104         |    181 |
-- | A101         |    184 |
-- | A103         |     17 |
-- | A101         |    300 |
-- | A102         |    205 |
-- | A104         |     93 |
-- | A103         |     12 |
-- | A107         |     87 |
-- +--------------+--------+
-- 10 rows in set (0.00 sec)


●カラムの値で計算して表示する-------------------------------------

$ SELECT uria*10000 as 売上 FROM tb;

-- +---------+
-- | 売上    |
-- +---------+
-- | 1010000 |
-- |  540000 |
-- | 1810000 |
-- | 1840000 |
-- |  170000 |
-- | 3000000 |
-- | 2050000 |
-- |  930000 |
-- |  120000 |
-- |  870000 |
-- +---------+
-- 10 rows in set (0.00 sec)

●関数を使って計算する--------------------------------

・AVERAGE関数
$ SELECT AVG(uria) as 売上平均 FROM tb;

-- +--------------+
-- | 売上平均     |
-- +--------------+
-- |     123.4000 |
-- +--------------+
-- 1 row in set (0.00 sec)

・SUM関数
$ SELECT SUM(uria) as 売上合計 FROM tb;

-- +--------------+
-- | 売上合計     |
-- +--------------+
-- |         1234 |
-- +--------------+
-- 1 row in set (0.00 sec)

・COUNT関数
$ SELECT COUNT(uria) as 売上件数 FROM tb;

-- +--------------+
-- | 売上件数     |
-- +--------------+
-- |           10 |
-- +--------------+
-- 1 row in set (0.00 sec)


●各種情報を表示する関数--------------------------------

・MySQLサーバーのバージョンを表示
$ SELECT VERSION();

-- +-----------+
-- | VERSION() |
-- +-----------+
-- | 5.7.26    |
-- +-----------+
-- 1 row in set (0.00 sec)


・現在使っているデータベースを表示
$ SELECT DATABASE();

-- +------------+
-- | DATABASE() |
-- +------------+
-- | db1        |
-- +------------+
-- 1 row in set (0.00 sec)

・現在のユーザーを表示
$ SELECT USER();

-- +----------------+
-- | USER()         |
-- +----------------+
-- | root@localhost |
-- +----------------+
-- 1 row in set (0.00 sec)

・引数指定した文字の文字エンコーディングを表示
$ SELECT CHARSET('この文字');

-- +-------------------------+
-- | CHARSET('この文字')     |
-- +-------------------------+
-- | utf8                    |
-- +-------------------------+
-- 1 row in set (0.00 sec)

