＊データを更新する
●データを更新する-----------------------------------------------

$ UPDATE テーブル名 SET カラム名 = 設定する値;

$ ALTER TABLE tb ADD COLUMN bikou VARCHAR(100);

$ UPDATE tb SET bikou='特記なし';

$ SELECT * FROM tb;

-- +------+------+------+--------------+
-- | bang | uria | tuki | bikou        |
-- +------+------+------+--------------+
-- | A103 |  101 |    4 | 特記なし     |
-- | A102 |   54 |    5 | 特記なし     |
-- | A104 |  181 |    4 | 特記なし     |
-- | A101 |  184 |    4 | 特記なし     |
-- | A103 |   17 |    5 | 特記なし     |
-- | A101 |  300 |    5 | 特記なし     |
-- | A102 |  205 |    6 | 特記なし     |
-- | A104 |   93 |    5 | 特記なし     |
-- | A103 |   12 |    6 | 特記なし     |
-- | A107 |   87 |    6 | 特記なし     |
-- +------+------+------+--------------+
-- 10 rows in set (0.00 sec)


●条件に一致するレコードのカラムだけ修正する---------------------------------------------

$ UPDATE テーブル名 SET カラム名 = 設定する値 WHERE 条件;

$ UPDATE tb SET bikou = '優秀' WHERE uria >= 100;

-- +------+------+------+--------------+
-- | bang | uria | tuki | bikou        |
-- +------+------+------+--------------+
-- | A103 |  101 |    4 | 優秀         |
-- | A102 |   54 |    5 | 特記なし     |
-- | A104 |  181 |    4 | 優秀         |
-- | A101 |  184 |    4 | 優秀         |
-- | A103 |   17 |    5 | 特記なし     |
-- | A101 |  300 |    5 | 優秀         |
-- | A102 |  205 |    6 | 優秀         |
-- | A104 |   93 |    5 | 特記なし     |
-- | A103 |   12 |    6 | 特記なし     |
-- | A107 |   87 |    6 | 特記なし     |
-- +------+------+------+--------------+
-- 10 rows in set (0.00 sec)


●売り上げ下位3件だけ「ガンバレ！」と修正-------------------------------------------

$ UPDATE tb SET bikou = 'ガンバレ!' ORDER BY uria DESC LIMIT 3;

-- +------+------+------+---------------+
-- | bang | uria | tuki | bikou         |
-- +------+------+------+---------------+
-- | A103 |  101 |    4 | 優秀          |
-- | A102 |   54 |    5 | 特記なし      |
-- | A104 |  181 |    4 | 優秀          |
-- | A101 |  184 |    4 | ガンバレ!     |
-- | A103 |   17 |    5 | 特記なし      |
-- | A101 |  300 |    5 | ガンバレ!     |
-- | A102 |  205 |    6 | ガンバレ!     |
-- | A104 |   93 |    5 | 特記なし      |
-- | A103 |   12 |    6 | 特記なし      |
-- | A107 |   87 |    6 | 特記なし      |
-- +------+------+------+---------------+
-- 10 rows in set (0.00 sec)


●条件に一致したレコードをコピーする------------------------------------------

$ create table tb_A101 select * from tb where bang like 'A101';

※すでに存在するテーブルにレコードを挿入する場合は、create table を insert intoに変更するだけ


●順番に並べてコピーする------------------------------------------

$ create table tb_2to5 select * from tb order by uria desc limit 4 offset 1;



＊条件に一致したレコードを削除する----------------------------------------

●特定のレコードを削除する-----------------------------------------------

$ delete from テーブル名 where 条件;

$ select from tb1I where tosi < 30;


●順番に並べ替えてから削除する----------------------------------------

$ delete from the_copy order by uria desc limit 4;


create table new_zaiko select * from zaiko where c > now() - interval 5 year;




